nxp-mcuxpresso/mcux-sdk-examples/evkcmimxrt1060/coex_examples/coex_wpa_supplicant/pin_mux.h
/* GPIO_SD_B0_01 (coord J3), SD1_CLK/J22[5]/J17[3] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_CLK_PERIPHERAL                            USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_CLK_SIGNAL                             usdhc_clk   /*!< Signal name */

/* GPIO_B1_12 (coord D13), SD_CD_SW/J22[9] */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD_CD_SW_PERIPHERAL                            GPIO2   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD_CD_SW_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITUSDHCPINS_SD_CD_SW_CHANNEL                                 28U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITUSDHCPINS_SD_CD_SW_GPIO                                  GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD_CD_SW_GPIO_PIN                                28U   /*!< GPIO pin number */
#define BOARD_INITUSDHCPINS_SD_CD_SW_GPIO_PIN_MASK                   (1U << 28U)   /*!< GPIO pin mask */
#define BOARD_INITUSDHCPINS_SD_CD_SW_PORT                                  GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD_CD_SW_PIN                                     28U   /*!< PORT pin number */
#define BOARD_INITUSDHCPINS_SD_CD_SW_PIN_MASK                        (1U << 28U)   /*!< PORT pin mask */

/* GPIO_B1_14 (coord C14), SD0_VSELECT */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD0_VSELECT_PERIPHERAL                        USDHC1   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD0_VSELECT_SIGNAL                     usdhc_vselect   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSDHCPins(void);

/* GPIO_SD_B1_08 (coord P3), FlexSPI_D0_A/U20[D3]/U24[5] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_D0_A_PERIPHERAL                       FLEXSPI   /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_D0_A_SIGNAL                   FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_SD_B1_09 (coord N4), FlexSPI_D1_A/U20[D2]/U24[2] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_D1_A_PERIPHERAL                       FLEXSPI   /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_D1_A_SIGNAL                   FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_SD_B1_10 (coord P4), FlexSPI_D2_A/U20[C4]/U24[3] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_D2_A_PERIPHERAL                       FLEXSPI   /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_D2_A_SIGNAL                   FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_SD_B1_11 (coord P5), FlexSPI_D3_A/U20[D4]/U24[7] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_D3_A_PERIPHERAL                       FLEXSPI   /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_D3_A_SIGNAL                   FLEXSPI_A_DATA3   /*!< Signal name */

/* GPIO_SD_B1_07 (coord L4), FlexSPI_CLK/U20[B2]/U24[6] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_CLK_PERIPHERAL                        FLEXSPI   /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_CLK_SIGNAL                     FLEXSPI_A_SCLK   /*!< Signal name */

/* GPIO_SD_B1_06 (coord L3), FlexSPI_SS0/U20[C2]/U24[1] */
/* Routed pin properties */
#define BOARD_INITQSPIPINS_FlexSPI_SS0_PERIPHERAL                        FLEXSPI   /*!< Peripheral name */
#define BOARD_INITQSPIPINS_FlexSPI_SS0_SIGNAL                    FLEXSPI_A_SS0_B   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSPIPins(void);

/* GPIO_AD_B1_14 (coord G12), SAI1_TX_BCLK/J35[1]/DC_I2S1_TX_BCLK/U23[23]/BT_PCM_BCLK/U9[7]/U10[17]/CSI_D3/J46[4] */
/* Routed pin properties */
#define BOARD_INIT_AUDIO_PINS_CSI_D3_PERIPHERAL                             SAI1   /*!< Peripheral name */
#define BOARD_INIT_AUDIO_PINS_CSI_D3_SIGNAL                          sai_tx_bclk   /*!< Signal name */

/* GPIO_AD_B1_12 (coord H12), SAI1_RXD/J41[1]/DC_I2S1_RX_D0/J23[11]/BT_PCM_RXD/U10[18]/CSI_D5/J46[5] */
/* Routed pin properties */
#define BOARD_INIT_AUDIO_PINS_CSI_D5_PERIPHERAL                             SAI1   /*!< Peripheral name */
#define BOARD_INIT_AUDIO_PINS_CSI_D5_SIGNAL                         sai_rx_data0   /*!< Signal name */

/* GPIO_AD_B1_15 (coord J14), SAI1_TX_SYNC/J36[1]/DC_I2S1_TX_SYNC/U23[16]/BT_PCM_SYNC/U9[8]/U10[16]/CSI_D2/J46[6] */
/* Routed pin properties */
#define BOARD_INIT_AUDIO_PINS_CSI_D2_PERIPHERAL                             SAI1   /*!< Peripheral name */
#define BOARD_INIT_AUDIO_PINS_CSI_D2_SIGNAL                          sai_tx_sync   /*!< Signal name */

/* GPIO_AD_B1_13 (coord H11), SAI1_TXD/J37[1]/DC_I2S1_TX_D0/J23[17]/BT_PCM_TXD/U9[6]/CSI_D4/J46[3] */
/* Routed pin properties */
#define BOARD_INIT_AUDIO_PINS_CSI_D4_PERIPHERAL                             SAI1   /*!< Peripheral name */
#define BOARD_INIT_AUDIO_PINS_CSI_D4_SIGNAL                         sai_tx_data0   /*!< Signal name */

/* GPIO_AD_B1_09 (coord M13), SAI1_MCLK/U369[G7]/DC_I2S1_MCLK/J23[1]/CSI_D8/J46[11] */
/* Routed pin properties */
#define BOARD_INIT_AUDIO_PINS_CSI_D8_PERIPHERAL                             SAI1   /*!< Peripheral name */
#define BOARD_INIT_AUDIO_PINS_CSI_D8_SIGNAL                             sai_mclk   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_Audio_Pins(void);

#define BOARD_INITPINSM2_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x01080000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */

/* GPIO_AD_B1_03 (coord M12), SPDIF_IN/U15[4]/WL_RST#/J8[56]/SD_PWREN/Q5[1]/J16[8] */
/* Routed pin properties */
#define BOARD_INITPINSM2_WL_RST_PERIPHERAL                                 GPIO1   /*!< Peripheral name */
#define BOARD_INITPINSM2_WL_RST_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINSM2_WL_RST_CHANNEL                                      19U   /*!< Signal channel */

