nxp-mcuxpresso/mcux-sdk-examples/evkcmimxrt1060/coex_examples/coex_wpa_supplicant/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINSM2_WL_RST_GPIO                                       GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINSM2_WL_RST_GPIO_PIN                                     19U   /*!< GPIO pin number */
#define BOARD_INITPINSM2_WL_RST_GPIO_PIN_MASK                        (1U << 19U)   /*!< GPIO pin mask */
#define BOARD_INITPINSM2_WL_RST_PORT                                       GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINSM2_WL_RST_PIN                                          19U   /*!< PORT pin number */
#define BOARD_INITPINSM2_WL_RST_PIN_MASK                             (1U << 19U)   /*!< PORT pin mask */

/* GPIO_AD_B1_08 (coord H13), AUD_INT/J34[5]/U25[15]/WIFI_RST_B/U9[3]/CSI_D9/J46[13]/J16[4] */
/* Routed pin properties */
#define BOARD_INITPINSM2_SDIO_RST_PERIPHERAL                               GPIO1   /*!< Peripheral name */
#define BOARD_INITPINSM2_SDIO_RST_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINSM2_SDIO_RST_CHANNEL                                    24U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINSM2_SDIO_RST_GPIO                                     GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINSM2_SDIO_RST_GPIO_PIN                                   24U   /*!< GPIO pin number */
#define BOARD_INITPINSM2_SDIO_RST_GPIO_PIN_MASK                      (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITPINSM2_SDIO_RST_PORT                                     GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINSM2_SDIO_RST_PIN                                        24U   /*!< PORT pin number */
#define BOARD_INITPINSM2_SDIO_RST_PIN_MASK                           (1U << 24U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinsM2(void);

/* GPIO_AD_B1_07 (coord K10), CSI_HSYNC/J46[16]/BT_UART_RXD/U10[20]/I2C3_SDA/J24[5]/J23[15]/J16[1] */
/* Routed pin properties */
#define BOARD_INITM2UARTPINS_CSI_HSYNC_PERIPHERAL                        LPUART3   /*!< Peripheral name */
#define BOARD_INITM2UARTPINS_CSI_HSYNC_SIGNAL                                 RX   /*!< Signal name */

/* GPIO_AD_B1_06 (coord J12), CSI_VSYNC/J46[18]/BT_UART_TXD/U9[4]/I2C3_SCL/J24[3]/J23[13]/J16[2] */
/* Routed pin properties */
#define BOARD_INITM2UARTPINS_CSI_VSYNC_PERIPHERAL                        LPUART3   /*!< Peripheral name */
#define BOARD_INITM2UARTPINS_CSI_VSYNC_SIGNAL                                 TX   /*!< Signal name */

/* GPIO_AD_B1_05 (coord K12), CSI_MCLK/J46[12]/WL_DEV_WAKE/BT_UART_RTS/U9[10]/J33[4] */
/* Routed pin properties */
#define BOARD_INITM2UARTPINS_CSI_MCLK_PERIPHERAL                         LPUART3   /*!< Peripheral name */
#define BOARD_INITM2UARTPINS_CSI_MCLK_SIGNAL                               RTS_B   /*!< Signal name */

/* GPIO_AD_B1_04 (coord L12), CSI_PIXCLK/J46[8]/BT_DEV_WAKE/BT_UART_CTS/U9[9]/J33[3] */
/* Routed pin properties */
#define BOARD_INITM2UARTPINS_CSI_PIXCLK_PERIPHERAL                       LPUART3   /*!< Peripheral name */
#define BOARD_INITM2UARTPINS_CSI_PIXCLK_SIGNAL                             CTS_B   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitM2UARTPins(void);

/* GPIO_AD_B0_04 (coord F11), DC_I2S2_TX_SYNC/J19[9]/BOOT_MODE[0] */
/* Routed pin properties */
#define BOARD_INITM2SCOPINS_DC_I2S2_TX_SYNC_PERIPHERAL                      SAI2   /*!< Peripheral name */
#define BOARD_INITM2SCOPINS_DC_I2S2_TX_SYNC_SIGNAL                   sai_tx_sync   /*!< Signal name */

/* GPIO_AD_B0_05 (coord G14), CAN_STBY/U23[8]/Flash_RST/U20[A4]/DC_I2S2_TX_BCLK/J19[3]/BOOT_MODE[1] */
/* Routed pin properties */
#define BOARD_INITM2SCOPINS_CAN_STBY_PERIPHERAL                             SAI2   /*!< Peripheral name */
#define BOARD_INITM2SCOPINS_CAN_STBY_SIGNAL                          sai_tx_bclk   /*!< Signal name */

/* GPIO_EMC_04 (coord F2), SEMC_D4/U16[C8] */
/* Routed pin properties */
#define BOARD_INITM2SCOPINS_SEMC_D4_PERIPHERAL                              SAI2   /*!< Peripheral name */
#define BOARD_INITM2SCOPINS_SEMC_D4_SIGNAL                           sai_tx_data   /*!< Signal name */
/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCodecPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitScoPins(void);

#define BOARD_INITENETPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x0600U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */

/* GPIO_EMC_40 (coord A7), ENET_MDC/U18[12] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_MDC_PERIPHERAL                              ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_MDC_SIGNAL                              enet_mdc   /*!< Signal name */

/* GPIO_EMC_41 (coord C7), ENET_MDIO/U18[11] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_MDIO_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_MDIO_SIGNAL                            enet_mdio   /*!< Signal name */

/* GPIO_B1_10 (coord B13), ENET_TX_REF_CLK/U18[9] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TX_REF_CLK_PERIPHERAL                       ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TX_REF_CLK_SIGNAL                   enet_ref_clk   /*!< Signal name */

/* GPIO_B1_04 (coord E12), ENET_RXD0/U18[16] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_RXD0_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_RXD0_SIGNAL                         enet_rx_data   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_RXD0_CHANNEL                                  0U   /*!< Signal channel */

/* GPIO_B1_05 (coord D12), ENET_RXD1/U18[15] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_RXD1_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_RXD1_SIGNAL                         enet_rx_data   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_RXD1_CHANNEL                                  1U   /*!< Signal channel */

