nxp-mcuxpresso/mcux-sdk-examples/evkcmimxrt1060/coex_examples/coex_wpa_supplicant/pin_mux.h
/* GPIO_B1_06 (coord C12), ENET_CRS_DV/U18[18] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_CRS_DV_PERIPHERAL                           ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_CRS_DV_SIGNAL                         enet_rx_en   /*!< Signal name */

/* GPIO_B1_11 (coord C13), ENET_RXER/U18[20] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_RXER_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_RXER_SIGNAL                           enet_rx_er   /*!< Signal name */

/* GPIO_B1_07 (coord B12), ENET_TXD0/U18[24] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TXD0_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TXD0_SIGNAL                         enet_tx_data   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_TXD0_CHANNEL                                  0U   /*!< Signal channel */

/* GPIO_B1_08 (coord A12), ENET_TXD1/U18[25] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TXD1_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TXD1_SIGNAL                         enet_tx_data   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_TXD1_CHANNEL                                  1U   /*!< Signal channel */

/* GPIO_B1_09 (coord A13), ENET_TXEN/U18[23] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TXEN_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TXEN_SIGNAL                           enet_tx_en   /*!< Signal name */

/* GPIO_AD_B0_10 (coord G13), JTAG_TDO/J2[13]/J3[2]/ENET_INT/U18[21]/INT1_COMBO/U115[11]/DC_I2S2_MCLK/J19[1]/J16[6] */
/* Routed pin properties */
#define BOARD_INITENETPINS_INT1_COMBO_PERIPHERAL                           GPIO1   /*!< Peripheral name */
#define BOARD_INITENETPINS_INT1_COMBO_SIGNAL                             gpio_io   /*!< Signal name */
#define BOARD_INITENETPINS_INT1_COMBO_CHANNEL                                10U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITENETPINS_INT1_COMBO_GPIO                                 GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITENETPINS_INT1_COMBO_GPIO_PIN                               10U   /*!< GPIO pin number */
#define BOARD_INITENETPINS_INT1_COMBO_GPIO_PIN_MASK                  (1U << 10U)   /*!< GPIO pin mask */
#define BOARD_INITENETPINS_INT1_COMBO_PORT                                 GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITENETPINS_INT1_COMBO_PIN                                    10U   /*!< PORT pin number */
#define BOARD_INITENETPINS_INT1_COMBO_PIN_MASK                       (1U << 10U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitEnetPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
